test/report_CA-test/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 775970,
    "errorCount" : 56959,
    "errorPct" : 7.340361,
    "meanResTime" : 2003.9837867443373,
    "medianResTime" : 31.0,
    "minResTime" : 13.0,
    "maxResTime" : 406397.0,
    "pct1ResTime" : 1068.0,
    "pct2ResTime" : 134181.9,
    "pct3ResTime" : 135237.97,
    "throughput" : 418.88714225870956,
    "receivedKBytesPerSec" : 650.8060663999914,
    "sentKBytesPerSec" : 50.03366824654
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 775970,
    "errorCount" : 56959,
    "errorPct" : 7.340361,
    "meanResTime" : 2003.9837867443373,
    "medianResTime" : 31.0,
    "minResTime" : 13.0,
    "maxResTime" : 406397.0,
    "pct1ResTime" : 1068.0,
    "pct2ResTime" : 134181.9,
    "pct3ResTime" : 135237.97,
    "throughput" : 418.88714225870956,
    "receivedKBytesPerSec" : 650.8060663999914,
    "sentKBytesPerSec" : 50.03366824654
  }
}